xml_logs/envio_lote_1781550256437_MS.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <gnreCabecMsg xmlns="http://www.gnre.pe.gov.br/webservice/GnreLoteRecepcao">
      <versaoDados>2.00</versaoDados>
    </gnreCabecMsg>
  </soap12:Header>
  <soap12:Body>
    <gnreDadosMsg xmlns="http://www.gnre.pe.gov.br/webservice/GnreLoteRecepcao">
      <TLote_GNRE xmlns="http://www.gnre.pe.gov.br" versao="2.00">
        <guias>
          <TDadosGNRE versao="2.00">
            <ufFavorecida>MS</ufFavorecida>
            <tipoGnre>0</tipoGnre>
            <contribuinteEmitente>
              <identificacao>
                <CNPJ>10436619000105</CNPJ>
              </identificacao>
              <razaoSocial>LALUA COMERCIO DE MODAS EIRELI</razaoSocial>
              <endereco>RUA MARECHAL ANDREA 82</endereco>
              <municipio>27408</municipio>
              <uf>BA</uf>
              <cep>41810105</cep>
            </contribuinteEmitente>
            <itensGNRE>
              <item>
                <receita>100102</receita>
                <documentoOrigem tipo="10">50345</documentoOrigem>
                <referencia>
                  <periodo>0</periodo>
                  <mes>04</mes>
                  <ano>2026</ano>
                </referencia>
                <dataVencimento>2026-06-18</dataVencimento>
                <valor tipo="11">46.90</valor>
                <valor tipo="21">46.90</valor>
                <contribuinteDestinatario>
                  <identificacao>
                    <CNPJ>13937073000156</CNPJ>
                  </identificacao>
                  <razaoSocial>BRUNA DE SOUZA DIAS</razaoSocial>
                  <municipio>02704</municipio>
                </contribuinteDestinatario>
                <camposExtras>
                  <campoExtra>
                    <codigo>88</codigo>
                    <valor>29260410436619000105550020000503451080431430</valor>
                  </campoExtra>
                </camposExtras>
              </item>
            </itensGNRE>
            <valorGNRE>46.90</valorGNRE>
            <dataPagamento>2026-06-18</dataPagamento>
          </TDadosGNRE>
        </guias>
      </TLote_GNRE>
    </gnreDadosMsg>
  </soap12:Body>
</soap12:Envelope>